{"title": "Netanyahu promises retaliation following assassination attempt by Hezbollah", "text": "Israeli Prime Minister Benjamin Netanyahu issued a warning to Hezbollah following its alleged assassination attempt against him and his wife, calling it a \"grave mistake.\"\n\n\"The attempt by Iran’s proxy Hezbollah to assassinate me and my wife today was a grave mistake,\" Netanyahu wrote in a X post Saturday. \"This will not deter me or the State of Israel from continuing our just war against our enemies in order to secure our future.\"\n\nIssuing a stark warning to Iran and the \"Axis of Resistance,\" which includes Hezbollah, Hamas and the Houthis, the prime minister said Israel is determined to achieve its war objectives following the Oct. 7 attack and \"change the security reality in our region for generations.\"\n\n\"I say to Iran and its proxies in its axis of evil: Anyone who tries to harm Israel's citizens will pay a heavy price; We will continue to eliminate the terrorists and those who dispatch them; We will bring our hostages home from Gaza; And we will return our citizens who live on our Northern border safely to their homes,\" he wrote.\n\n\"Israel is determined to achieve all our war objectives and change the security reality in our region for generations to come,\" Netanyahu said.\n\nTogether, we will fight, and with God's help – together, we will win. — Israeli Prime Minister Benjamin Netanyahu\n\nUAV LAUNCHED TOWARD ISRAELI PM NETANYAHU'S PRIVATE RESIDENCE IN CAESAREA\n\nNetanyahu's vow to hold Hezbollah accountable came after a UAV was launched towards his private residence in the coastal city of Caesarea on Saturday morning.\n\nNetanyahu and his wife were not home when the incident happened, his spokesperson told Fox News.\n\nNo injuries were reported in the incident. Israel's Channel 12 reported that Netanyahu had not been at his private residence for several days.\n\nThe Israeli military said that three drones had been fired from Lebanon on Saturday towards the prime minister's house, but two had been intercepted.\n\nIDF VIDEO: ISRAELI TANK FIRES AT BUILDING WHERE HAMAS LEADER YAHYA SINWAR WAS BARRICADED BEFORE BEING KILLED\n\nThere were reports of some minor damage to the residence but Fox News Digital couldn't confirm that report.\n\nWATCH:\n\nFollowing the assassination attempt, Netanyahu released a video message, confidently declaring that \"we're going to win this war.\"\n\n\"Two days ago we took out Sinwar, the terrorist mastermind whose goons beheaded our men, raped our women and burned our babies alive,\" he said. \"We took him out, and we're continuing to battle with Iran's other terrorist proxies.\"\n\n\"We're going to win this war,\" he said.\n\nU.S. Secretary of Defense Lloyd Austin III spoke with Israeli Minister of Defense Yoav Gallant, the Pentagon spokesperson, Maj. Gen. Pat Ryder said.\n\nWHO WAS YAHYA SINWAR? THE ISRAELI PRISONER TURNED TERRORIST HAMAS LEADER KILLED BY IDF TROOPS\n\nRyder said that Sec. Austin reviewed U.S. force-posture adjustments, including the recent deployment of a Terminal High-Altitude Area Defense system to reinforce Israel’s defenses in the face of threats from Iran, Lebanese Hezbollah, and Iranian proxies.\n\nThe Secretary also told Minister Gallant that he was relieved Netanyahu was safe following the attack.\n\nSpeaker of the House Mike Johnson wrote on X that he spoke with Netanyahu, saying that the prime minister remained \"undettered.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"I spoke with my friend Prime Minister Netanyahu today, and I am happy to report he is safe, in good spirits, and undeterred,\" Johnson said. \"I told him America stands strong with Israel and reiterated our ongoing commitment to help counter Iran and its terrorist proxies. This is a crucial.\"\n\nFox News Digital's Landon Mion and Younat Friling contributed to this report."}