{"title": "Harris and Trump converge on razor-tight Michigan in pursuit of a winning coalition", "text": "CNN —\n\nVice President Kamala Harris and former President Donald Trump collided Friday in Michigan, both barnstorming the state as they wage a tight battle for its potentially decisive 15 Electoral College votes.\n\nThe two converged on vote-rich Oakland County, northwest of Detroit – where an increasingly educated, diverse population and the suburban revolt against Trump has shifted the political landscape in Democrats’ favor in recent years.\n\nHarris told a crowd in Waterford Township that Trump was “full of big promises, but always fails to deliver” and called him “one of the biggest losers of manufacturing jobs in American history.”\n\nShe touted her support for labor unions and said she’d push the federal government and private businesses to hire more workers without college degrees.\n\nIt was a blue-collar pitch that Harris also made Friday in Grand Rapids, a Western Michigan city in Kent County, which swung from Trump in 2016 to Joe Biden in 2020, and Lansing, where she panned Trump’s record on manufacturing and told union members that the former president is “no friend of labor.”\n\nBefore closing his night with a Detroit rally, Trump also stopped in Oakland County for a roundtable in Auburn Hills. He said he’d boost American auto manufacturing by slapping steep tariffs on imported vehicles.\n\n“I think it’s more beautiful than love, the word tariff,” Trump said.\n\nMichigan, Pennsylvania and Wisconsin make up the “blue wall” – three Great Lakes battlegrounds that tipped the 2016 election to Trump and flipped back to hand Biden the White House four years later.\n\nAlthough Michigan went for Biden by about 154,000 votes, it also delivered Trump a historic win in 2016, when he defeated Hillary Clinton by fewer than 11,000 votes, breaking a streak of Democratic wins there since 1992.\n\nAlready, more than 944,000 early ballots have been cast in Michigan — 13% of the state’s active registered voters, according to the secretary of state’s office.\n\nBoth campaigns are targeting specific pockets of prospective voters in Michigan, including union workers, Black voters, suburban moderates and Arab Americans who are unhappy with the Biden administration’s handling of Israel’s war in Gaza.\n\nHarris speaks at a campaign event in Waterford Township, Michigan, on October 18, 2024. Rebecca Cook/Reuters\n\nBattle for Arab American voters\n\nTrump on Friday visited a campaign office in Hamtramck, which has a large Muslim and Arab American population. He stood with the city’s mayor, Amer Ghalib, who recently endorsed the former president.\n\nTrump, who has vowed to conduct mass deportations of undocumented immigrants if reelected, at one point was asked by the mayor: “One thing that the Democrats keep sending to our community to scare them that you will come and deport them, although some of them are second- and third-generation immigrants. So I want you to respond to these accusations and hear delivering to our community. What would you say to them?”\n\n“Fake news,” the former president responded.\n\nEarlier in the day, Trump had told reporters he planned to speak soon to Israeli Prime Minister Benjamin Netanyahu, who he said is doing a “good job.” He said Biden is “trying to hold him back, and he probably should be doing the opposite.”\n\nHarris, hours later in Waterford Township, acknowledged the “very difficult” year for members of the Arab American community.\n\nShe touted the support of “Arab American leaders” and named Wayne County deputy executive Assad Turfe but said she recognized that Israel’s military campaigns in Gaza and in Lebanon have troubled members of the sizable Arab American and Muslim communities, who she said have “deep and proud roots in the Detroit metro area.”\n\nHarris also reiterated her belief that the death of Hamas leader Yahya Sinwar could create an opportunity to renew negotiations for a ceasefire and hostage release deal between Israel and Hamas.\n\n“Sinwar’s death can and must be a turning point. Everyone must seize this opportunity to finally end the war in Gaza, bring the hostages home and end the suffering once and for all,” she said. “And I continue to believe diplomacy is the answer to bringing lasting stability across the Israel-Lebanon border.”\n\nHarris targets Trump’s blue-collar appeal\n\nEarlier in the day, the vice president spoke to union members in Lansing, where she played clips of Trump disparaging the labor of auto workers, attacking United Auto Workers president Shawn Fain and saying he “used to hate to pay overtime” when he oversaw his companies prior to entering politics.\n\nTrump has courted auto workers in Michigan with pledges to impose steep tariffs on vehicles imported from Mexico and China. He has also proposed making interest on car loans tax-deductible.\n\nThe Harris campaign’s decision to highlight Trump’s own words comes as Democrats try to bridge a gap between union leaders, who largely support Harris and align closely with her party on labor policies, and their members, who in some cases align more closely with Republicans on cultural issues.\n\n“Listen to his words,” Harris said after the 35-second video played for the audience. “He’s saying that auto workers are essentially engaged in child’s play, that children can do it.”\n\n“He’s got his club, and I’m going to tell you, union workers are not part of his club. Let’s be clear about that. No matter what he does at his rallies,” she added. “To compare it to child’s work? When we here know the work you do is complex. You do it with great care. You work hard. You are highly skilled. You are highly trained, and the best auto workers in the world is who you are.”\n\nHarris supporters hold signs during her campaign event in Waterford Township, Michigan, on October 18, 2024. Rebecca Cook/Reuters\n\nTrump returns to city he’d insulted\n\nTrump’s visit to Detroit was his first back to the Motor City since insulting it at a Detroit Economic Club event last week. In those remarks, Trump compared Detroit, the state’s largest city, to a “developing nation,” and warned that if Harris wins on November 5, the “whole country will end up being like Detroit.”\n\nMichigan Democratic Gov. Gretchen Whitmer’s Fight Like Hell PAC launched a radio ad Friday highlighting Trump’s disparagement of Detroit.\n\n“Donald Trump recently came to Detroit and talked trash about our city. He called Detroit a failure and a mess. We know he’s wrong. Detroiters don’t give up on each other or their city, something Donald Trump will never understand,” Whitmer says in the 30-second spot.\n\nIn his return to the city Friday, Trump told the crowd that Election Day “will be liberation day in America.”\n\nTrump said that he thought Detroit “has such great potential” but that Democrats have “been wreaking havoc on this place” and undermining its long-promised comeback.\n\n“I am proclaiming to the people of this state that by the end of my term, the entire world will be talking about the Michigan miracle and the stunning rebirth of Detroit,” he said.\n\nThis story’s headline has been updated.\n\nCNN’s Ali Main and Ethan Cohen contributed to this report."}